// 내가 푼 방법 ============================================
// function 문제(입력문자) {
//   let 답;

//   답 = 입력문자.replace(/A/gi, "#");

//   return 답;
// }

// let 입력문자 = "BANANA";
// console.log(문제(입력문자));
// 내가 푼 방법 ============================================

function solution(s) {
  // 선생님이 푼 방법 1.
  // let answer = "";
  // for (let x of s) {
  //   if (x === "A") answer += "#";
  //   else answer += x;
  // }
  // =======================================================
  // =======================================================
  // =======================================================
  // 선생님이 푼 방법 2.
  // let answer = s;
  // answer = answer.replace(/A/g, "#");
  // return answer;
}

let str = "BANANA";
console.log(solution(str));
